In [2]:
import pandas as pd

In [3]:
Dict={"Age": pd.Series([25,30,35],index=["Sylvie","Gilles","Sylvain"]),
     "Ville" : pd.Series(["Lorient","Angers","Vannes","Le Mans"],index=["Sylvie","Gilles","Sylvain","Thomas"])}

In [4]:
DF = pd.DataFrame(Dict)
DF

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas    NaN  Le Mans

In [5]:
type(DF)

pandas.core.frame.DataFrame

In [6]:
type(DF["Ville"])

pandas.core.series.Series

In [7]:
DF.index

Index(['Gilles', 'Sylvain', 'Sylvie', 'Thomas'], dtype='object')

In [8]:
DF.columns

Index(['Age', 'Ville'], dtype='object')

In [10]:
Dict={"Prenom" : ["Sylvie","Gilles","Sylvain","Thomas"], "Age" : [25,30,35,40] }
DF=pd.DataFrame(Dict)
DF

    Prenom  Age
0   Sylvie   25
1   Gilles   30
2  Sylvain   35
3   Thomas   40

In [62]:
DF=pd.DataFrame(Dict, index = ["La Schtrompfette", "Le démolisseur", "Le crack","Le BG"])
DF

                   Prenom  Age
La Schtrompfette   Sylvie   25
Le démolisseur     Gilles   30
Le crack          Sylvain   35
Le BG              Thomas   40

In [63]:
DF["Prenom"]

La Schtrompfette     Sylvie
Le démolisseur       Gilles
Le crack            Sylvain
Le BG                Thomas
Name: Prenom, dtype: object

In [64]:
print(DF.loc["Le BG"])
print(DF.iloc[3])

Prenom    Thomas
Age           40
Name: Le BG, dtype: object
Prenom    Thomas
Age           40
Name: Le BG, dtype: object

In [17]:
DF["Prenom"]["Le crack"]

'Sylvain'

In [67]:
DF[(DF["Age"]>30) & (DF["Age"]<40)]

           Prenom  Age
Le crack  Sylvain   35

In [40]:
(DF["Age"]>30) and (DF["Age"]<40)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [46]:
1==0 or 2==2

True

In [49]:
DF=DF.rename(columns = {"Age" : "Sous"})
print(DF)

                   Prenom  Sous
La Schtrompfette   Sylvie    25
Le démolisseur     Gilles    30
Le crack          Sylvain    35
Le BG              Thomas    40

In [50]:
DF1=pd.DataFrame({"Nom":['Gilles','Sylvain'],'Age':[25,28]})
DF2=pd.DataFrame({"Nom":['Gilles','Sylvain'],'Age':[25,28]})

In [53]:
DF1

       Nom  Age
0   Gilles   25
1  Sylvain   28

In [54]:
DF2

       Nom  Age
0   Gilles   25
1  Sylvain   28

In [55]:
pd.concat([DF1,DF2])

       Nom  Age
0   Gilles   25
1  Sylvain   28
0   Gilles   25
1  Sylvain   28

In [57]:
DF3=pd.DataFrame({"Profession":['Plombier','Electricien'],'Tel':["05-87-52-10-49","05-14-21-78-91"]})
DF3

    Profession             Tel
0     Plombier  05-87-52-10-49
1  Electricien  05-14-21-78-91

In [58]:
DFC=pd.concat((DF1,DF3),axis=1)
DFC

       Nom  Age   Profession             Tel
0   Gilles   25     Plombier  05-87-52-10-49
1  Sylvain   28  Electricien  05-14-21-78-91